xsh381503442/xsh/NRF52832/NRF52832/nRF5_SDK_14.1.0_1dda907/components/ble/peer_manager/security_dispatcher.c
    if (peer_id == PM_PEER_ID_INVALID)
    {
        peer_id = im_peer_id_get_by_conn_handle(p_gap_evt->conn_handle);
    }
    else
    {
			NRF_LOG_DEBUG("The peer might have been unrecognized until now (since connecting). E.g. if using a");
			NRF_LOG_DEBUG("random non-resolvable advertising address. Report the discovered peer ID just in case.");
        // The peer might have been unrecognized until now (since connecting). E.g. if using a
        // random non-resolvable advertising address. Report the discovered peer ID just in case.
        im_new_peer_id(p_gap_evt->conn_handle, peer_id);
    }

    sec_proc_start(p_gap_evt->conn_handle, true, PM_LINK_SECURED_PROCEDURE_ENCRYPTION);

    if (peer_id != PM_PEER_ID_INVALID)
    {
        err_code = pdb_peer_data_ptr_get(peer_id, PM_PEER_DATA_ID_BONDING, &peer_data);

        if (err_code == NRF_SUCCESS)
        {
					NRF_LOG_DEBUG("There is stored bonding data for this peer.");
            // There is stored bonding data for this peer.
            ble_gap_enc_key_t const * p_existing_key = &peer_data.p_bonding_data->own_ltk;

            if (   p_existing_key->enc_info.lesc
                || (im_master_ids_compare(&p_existing_key->master_id,
                                          &p_gap_evt->params.sec_info_request.master_id)))
            {
                p_enc_info = &p_existing_key->enc_info;
            }
        }
    }

    err_code = sd_ble_gap_sec_info_reply(p_gap_evt->conn_handle, p_enc_info, NULL, NULL);

    if (err_code != NRF_SUCCESS)
    {
        sec_proc_housekeeping(p_gap_evt->conn_handle, peer_id, false, false);
        send_unexpected_error(p_gap_evt->conn_handle, err_code);
    }
    else if (p_enc_info == NULL)
    {
        sec_proc_housekeeping(p_gap_evt->conn_handle, peer_id, false, false);
        encryption_failure(p_gap_evt->conn_handle,
                           PM_CONN_SEC_ERROR_PIN_OR_KEY_MISSING,
                           BLE_GAP_SEC_STATUS_SOURCE_LOCAL);
    }

    return;
}



/**@brief Function for sending a CONFIG_REQ event.
 *
 * @param[in]  conn_handle  The connection the sec parameters are needed for.
 */
static void send_config_req(uint16_t conn_handle)
{
	NRF_LOG_DEBUG("send_config_req");
    pm_evt_t evt;
    memset(&evt, 0, sizeof(evt));

    evt.evt_id      = PM_EVT_CONN_SEC_CONFIG_REQ;
    evt.conn_handle = conn_handle;

    evt_send(&evt);
}


void smd_conn_sec_config_reply(uint16_t conn_handle, pm_conn_sec_config_t * p_conn_sec_config)
{
	NRF_LOG_DEBUG("smd_conn_sec_config_reply");
    NRF_PM_DEBUG_CHECK(m_module_initialized);
    NRF_PM_DEBUG_CHECK(p_conn_sec_config != NULL);

    ble_conn_state_user_flag_set(conn_handle,
                                 m_flag_allow_repairing,
                                 p_conn_sec_config->allow_repairing);
}


/**@brief Function for processing the @ref BLE_GAP_EVT_DISCONNECT event from the SoftDevice.
 *
 * @param[in]  p_gap_evt  The event from the SoftDevice.
 */
static void disconnect_process(ble_gap_evt_t const * p_gap_evt)
{
	NRF_LOG_DEBUG("disconnect_process");
    pm_sec_error_code_t error = (p_gap_evt->params.disconnected.reason
                                        == BLE_HCI_CONN_TERMINATED_DUE_TO_MIC_FAILURE)
                                ? PM_CONN_SEC_ERROR_MIC_FAILURE : PM_CONN_SEC_ERROR_DISCONNECT;

    link_secure_failure(p_gap_evt->conn_handle, error, BLE_GAP_SEC_STATUS_SOURCE_LOCAL);
}


/**@brief Function for sending a PARAMS_REQ event.
 *
 * @param[in]  conn_handle    The connection the security parameters are needed for.
 * @param[in]  p_peer_params  The security parameters from the peer. Can be NULL if the peer's parameters
 *                            are not yet available.
 */
static void send_params_req(uint16_t conn_handle, ble_gap_sec_params_t const * p_peer_params)
{
	NRF_LOG_DEBUG("send_params_req");
    pm_evt_t evt =
    {
        .evt_id      = PM_EVT_CONN_SEC_PARAMS_REQ,
        .conn_handle = conn_handle,
        .params      =
        {
            .conn_sec_params_req =
            {
                .p_peer_params = p_peer_params
            },
        },
    };

    evt_send(&evt);
}


/**@brief Function for processing the @ref BLE_GAP_EVT_SEC_PARAMS_REQUEST event from the SoftDevice.
 *
 * @param[in]  p_gap_evt  The event from the SoftDevice.
 */
static void sec_params_request_process(ble_gap_evt_t const * p_gap_evt)
{
	NRF_LOG_DEBUG("sec_params_request_process");
    if (ble_conn_state_role(p_gap_evt->conn_handle) == BLE_GAP_ROLE_PERIPH)
    {
        sec_proc_start(p_gap_evt->conn_handle,
                       true,
                       p_gap_evt->params.sec_params_request.peer_params.bond
                                               ? PM_LINK_SECURED_PROCEDURE_BONDING
                                               : PM_LINK_SECURED_PROCEDURE_PAIRING);
    }

    send_params_req(p_gap_evt->conn_handle, &p_gap_evt->params.sec_params_request.peer_params);
    return;
}


/**@brief Function for processing the @ref BLE_GAP_EVT_AUTH_STATUS event from the SoftDevice, when
 *        the auth_status is success.
 *
 * @param[in]  p_gap_evt  The event from the SoftDevice.
 */
static void auth_status_success_process(ble_gap_evt_t const * p_gap_evt)
{
	NRF_LOG_DEBUG("auth_status_success_process");
    ret_code_t           err_code    = NRF_SUCCESS;
    uint16_t             conn_handle = p_gap_evt->conn_handle;
    uint8_t              role        = ble_conn_state_role(conn_handle);
    pm_peer_id_t         peer_id     = im_peer_id_get_by_conn_handle(conn_handle);
    pm_peer_id_t         new_peer_id = peer_id;
    pm_peer_data_t       peer_data;
    bool                 data_stored = false;

    ble_conn_state_user_flag_set(conn_handle, m_flag_sec_proc, false);

    if (role == BLE_GAP_ROLE_INVALID)
    {
			NRF_LOG_DEBUG("Unlikely, but maybe possible?");
        /* Unlikely, but maybe possible? */
        return;
    }

    if (p_gap_evt->params.auth_status.bonded)
    {
			NRF_LOG_DEBUG("p_gap_evt->params.auth_status.bonded == true");
        pm_peer_id_t duplicate_peer_id = PM_PEER_ID_INVALID;
        data_stored = true;

        err_code = pdb_write_buf_get(peer_id, PM_PEER_DATA_ID_BONDING, 1, &peer_data);
        if (err_code != NRF_SUCCESS)
        {
            send_unexpected_error(conn_handle, err_code);
            data_stored = false;
        }
        else
        {
            duplicate_peer_id = im_find_duplicate_bonding_data(peer_data.p_bonding_data,
                                                               PM_PEER_ID_INVALID);
        }

        if (duplicate_peer_id != PM_PEER_ID_INVALID)
        {
					NRF_LOG_DEBUG("The peer has been identified as someone we have already bonded with.");
            // The peer has been identified as someone we have already bonded with.
            new_peer_id = duplicate_peer_id;
            im_new_peer_id(conn_handle, new_peer_id);

					NRF_LOG_DEBUG("If the flag is true, the configuration has been requested before.");
            // If the flag is true, the configuration has been requested before.
            if (!allow_repairing(conn_handle))
            {
                send_config_req(conn_handle);
                if (!allow_repairing(conn_handle))
                {
                    data_stored = false;
                }
            }
        }

        if (data_stored)
        {
            err_code = pdb_write_buf_store(peer_id, PM_PEER_DATA_ID_BONDING, new_peer_id);
            if (err_code != NRF_SUCCESS)
            {
							NRF_LOG_DEBUG("Unexpected");
                /* Unexpected */
                send_unexpected_error(conn_handle, err_code);
                data_stored = false;
            }
        }

        if ((duplicate_peer_id != PM_PEER_ID_INVALID) && peer_created(conn_handle))
        {
					NRF_LOG_DEBUG("We already have a bond with the peer. Now that the data has been stored for the");
					NRF_LOG_DEBUG("existing peer, the peer created for this bonding procedure can be freed.");
            // We already have a bond with the peer. Now that the data has been stored for the
            // existing peer, the peer created for this bonding procedure can be freed.
            ret_code_t err_code_free = im_peer_free(peer_id);
            UNUSED_VARIABLE(err_code_free); // Errors can be safely ignored.
					NRF_LOG_DEBUG("Errors can be safely ignored.");
        }
    }
    else if (peer_created(conn_handle))
    {
        ret_code_t err_code_free = im_peer_free(peer_id);
        UNUSED_VARIABLE(err_code_free); // Errors can be safely ignored.
			NRF_LOG_DEBUG("Errors can be safely ignored.");
    }
    else
    {
        // No action.
    }

    pm_evt_t pairing_success_evt;

    pairing_success_evt.evt_id                                = PM_EVT_CONN_SEC_SUCCEEDED;
    pairing_success_evt.conn_handle                           = conn_handle;
    pairing_success_evt.params.conn_sec_succeeded.procedure   = p_gap_evt->params.auth_status.bonded
                                                              ? PM_LINK_SECURED_PROCEDURE_BONDING
                                                              : PM_LINK_SECURED_PROCEDURE_PAIRING;
    pairing_success_evt.params.conn_sec_succeeded.data_stored = data_stored;

    evt_send(&pairing_success_evt);

    return;
}


/**@brief Function for processing the @ref BLE_GAP_EVT_AUTH_STATUS event from the SoftDevice, when
 *        the auth_status is failure.
 *
 * @param[in]  p_gap_evt  The event from the SoftDevice.
 */
static void auth_status_failure_process(ble_gap_evt_t const * p_gap_evt)
{
	NRF_LOG_DEBUG("auth_status_failure_process");
    link_secure_failure(p_gap_evt->conn_handle,
                        p_gap_evt->params.auth_status.auth_status,
                        p_gap_evt->params.auth_status.error_src);
}


