xsh381503442/xsh/NRF52832/NRF52832/nRF5_SDK_14.1.0_1dda907/components/ble/peer_manager/security_dispatcher.c
        peer_id = im_peer_id_get_by_conn_handle(conn_handle);

        if (peer_id == PM_PEER_ID_INVALID)
        {
					NRF_LOG_DEBUG("Peer is unknown to us, allocate a new peer ID for it.");
            // Peer is unknown to us, allocate a new peer ID for it.
            peer_id = pdb_peer_allocate();
            if (peer_id != PM_PEER_ID_INVALID)
            {
							NRF_LOG_DEBUG("new_peer_created = true");
                new_peer_created = true;
            }
            else
            {
							NRF_LOG_DEBUG("NRF_ERROR_INTERNAL");
                err_code = NRF_ERROR_INTERNAL;
            }
        }
        else if (role == BLE_GAP_ROLE_PERIPH && !allow_repairing(conn_handle))
        {
					NRF_LOG_DEBUG("Bond already exists. Reject the pairing request if the user doesn't intervene.");
					NRF_LOG_DEBUG("send_config_req(conn_handle, peer_id)");
            // Bond already exists. Reject the pairing request if the user doesn't intervene.
            // send_config_req(conn_handle, peer_id);
            send_config_req(conn_handle);
            if (!allow_repairing(conn_handle))
            {
							NRF_LOG_DEBUG("Reject pairing.");
                // Reject pairing.
                sec_status = BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP;
            }
        }

        if ((sec_status != BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP) && (err_code == NRF_SUCCESS))
        {
					NRF_LOG_DEBUG("sec_status != BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP && err_code == NRF_SUCCESS");
            err_code = sec_keyset_fill(conn_handle, peer_id, role, p_public_key, &sec_keyset);
        }
    }

    if (err_code == NRF_SUCCESS)
    {
			NRF_LOG_DEBUG("Everything OK, reply to SoftDevice. If an error happened, the user is given an");
			NRF_LOG_DEBUG("opportunity to change the parameters and retry the call.");
        // Everything OK, reply to SoftDevice. If an error happened, the user is given an
        // opportunity to change the parameters and retry the call.
        if (role == BLE_GAP_ROLE_PERIPH)
        {
					NRF_LOG_DEBUG("role == BLE_GAP_ROLE_PERIPH");
            err_code = sd_ble_gap_sec_params_reply(conn_handle, sec_status, p_sec_params, &sec_keyset);
        }
        else
        {
					NRF_LOG_DEBUG("role != BLE_GAP_ROLE_PERIPH");
            err_code = sd_ble_gap_sec_params_reply(conn_handle, sec_status, NULL, &sec_keyset);
        }
    }

    sec_proc_housekeeping(conn_handle,
                          peer_id,
                          (err_code == NRF_SUCCESS) && (sec_status == BLE_GAP_SEC_STATUS_SUCCESS),
                          new_peer_created);

    return err_code;
}


#if PM_CENTRAL_ENABLED
/**@brief Function for initiating encryption as a central. See @ref smd_link_secure for more info.
 */
static ret_code_t link_secure_central_encryption(uint16_t     conn_handle,
                                                 pm_peer_id_t peer_id)
{
    pm_peer_data_flash_t      peer_data;
    ret_code_t                err_code;
    ble_gap_enc_key_t const * p_existing_key = NULL;
    bool                      lesc = false;

    err_code = pdb_peer_data_ptr_get(peer_id, PM_PEER_DATA_ID_BONDING, &peer_data);

    if (err_code == NRF_SUCCESS)
    {
        // Use peer's key since they are peripheral.
        p_existing_key = &(peer_data.p_bonding_data->peer_ltk);

        lesc = peer_data.p_bonding_data->own_ltk.enc_info.lesc;
        if  (lesc) // LESC was used during bonding.
        {
            // For LESC, always use own key.
            p_existing_key = &(peer_data.p_bonding_data->own_ltk);
        }
    }

    if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_NOT_FOUND))
    {
        if (err_code != NRF_ERROR_BUSY)
        {
            // Unexpected error code.
            err_code = NRF_ERROR_INTERNAL;
        }
    }
    else if (p_existing_key == NULL)  /* There is no bonding data stored. This means that a bonding
                                         procedure is in ongoing, or that the records in flash are
                                         in a bad state. */
    {
        err_code = NRF_ERROR_BUSY;
    }
    else if (!lesc && !im_master_id_is_valid(&(p_existing_key->master_id))) /* There is no valid LTK stored. */
    {
        // No LTK to encrypt with.
        err_code = NRF_ERROR_INVALID_DATA;
    }
    else
    {
        // Encrypt with existing LTK.
        err_code = sd_ble_gap_encrypt(conn_handle,
                                    &(p_existing_key->master_id),
                                    &(p_existing_key->enc_info));
    }

    sec_proc_start(conn_handle, err_code == NRF_SUCCESS, PM_LINK_SECURED_PROCEDURE_ENCRYPTION);
    sec_proc_housekeeping(conn_handle, peer_id, (err_code == NRF_SUCCESS), false);

    return err_code;
}


/**@brief Function for intiating pairing as a central. See @ref smd_link_secure for more info.
 */
static ret_code_t link_secure_central_pairing(uint16_t               conn_handle,
                                              pm_peer_id_t           peer_id,
                                              ble_gap_sec_params_t * p_sec_params)
{
    pm_conn_sec_procedure_t procedure        = PM_LINK_SECURED_PROCEDURE_PAIRING;
    bool                    new_peer_created = false;
    ret_code_t              err_code         = NRF_SUCCESS;
    pm_peer_data_t          dummy_peer_data;

    if (p_sec_params == NULL)
    {
        err_code  = sd_ble_gap_authenticate(conn_handle, NULL);
    }
    else
    {
        if (p_sec_params->bond)
        {
            procedure = PM_LINK_SECURED_PROCEDURE_BONDING;

            if (peer_id == PM_PEER_ID_INVALID)
            {
                // New peer is required.
                peer_id = pdb_peer_allocate();
                new_peer_created = true;
            }

            if (peer_id == PM_PEER_ID_INVALID)
            {
                err_code = NRF_ERROR_INTERNAL;
            }
            else
            {
                err_code = pdb_write_buf_get(peer_id, PM_PEER_DATA_ID_BONDING, 1, &dummy_peer_data);
                if (err_code == NRF_SUCCESS)
                {
                    err_code = pdb_write_buf_store_prepare(peer_id, PM_PEER_DATA_ID_BONDING);
                }
            }
        }

        if (err_code == NRF_SUCCESS)
        {
            err_code = sd_ble_gap_authenticate(conn_handle, p_sec_params);
        }

        if (err_code != NRF_SUCCESS)
        {
            ret_code_t err_code_free = pdb_write_buf_release(peer_id, PM_PEER_DATA_ID_BONDING);
            if ((err_code_free != NRF_SUCCESS) && (err_code_free != NRF_ERROR_NOT_FOUND))
            {
                err_code = NRF_ERROR_INTERNAL;
            }
        }
    }

    if (err_code == NRF_ERROR_NO_MEM)
    {
        // sd_ble_gap_authenticate() returned NRF_ERROR_NO_MEM. Too many other sec procedures running.
        err_code = NRF_ERROR_BUSY;
    }

    sec_proc_start(conn_handle, err_code == NRF_SUCCESS, procedure);
    sec_proc_housekeeping(conn_handle, peer_id, (err_code == NRF_SUCCESS), new_peer_created);

    return err_code;
}



